{
  "backend/main.mo": "Motoko actor defining types and CRUD-style functions for daily briefs, research items, portfolio snapshots, alert rules, profiles, and assets using in‑memory maps.",
  "feature_evidence.json": "Machine-readable feature evidence report mapping feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend source files and components.",
  "frontend/DRAFT_PREVIEW.md": "Guide describing how to run a local preview build of PulseBrief for testing without deployment.",
  "frontend/index.css": "Tailwind CSS config with light/dark theme variables and base styling rules.",
  "frontend/index.html": "HTML entry point loading the root React app and including favicon and metadata.",
  "frontend/src/App.tsx": "Defines TanStack Router configuration with public and protected routes, ThemeProvider, AppShell, and route tree setup.",
  "frontend/src/components/auth/PrototypeSignInDialog.tsx": "Email-based sign-in modal for the prototype with validation, toast feedback, and session state updates.",
  "frontend/src/components/brand/ClickableWordmark.tsx": "Clickable PulseBrief wordmark button that navigates to the home route.",
  "frontend/src/components/brand/Wordmark.tsx": "Simple component rendering the PulseBrief wordmark image with size variants.",
  "frontend/src/components/brief/YesterdayVsTodayWidget.tsx": "Compares today's and yesterday's brief scores and displays deltas with icons. Shows a placeholder card if either day is missing.",
  "frontend/src/components/charts/ChartPlaceholder.tsx": "Renders a generic placeholder card for charts with a title, description, and icon.",
  "frontend/src/components/common/DemoStateIndicator.tsx": "Displays a small badge indicating the UI is in a demo or preview state.",
  "frontend/src/components/common/ScorePill.tsx": "Shows a colored pill displaying score/max with color based on percentage and size options.",
  "frontend/src/components/common/StandardScore.tsx": "Displays a labeled score with tooltip explanation, sanitizing the explanation to one sentence.",
  "frontend/src/components/compliance/DisclaimerBar.tsx": "Footer bar showing a non‑advice disclaimer and a copyright notice with branding links.",
  "frontend/src/components/layout/AppNav.tsx": "Top navigation bar with routes, active state, user info, and logout handling.",
  "frontend/src/components/layout/AppShell.tsx": "Wraps the app layout with navigation, main content area, and footer disclaimer.",
  "frontend/src/components/layout/ProtectedPrototypeGate.tsx": "Gatekeeper component redirecting unauthenticated users to sign‑in and optionally showing a modal.",
  "frontend/src/components/portfolio/AssetEditor.tsx": "Form for adding a portfolio asset with validation, sign‑in enforcement, and mutation handling.",
  "frontend/src/components/states/EmptyState.tsx": "Centered empty state component with icon, title, description, and optional action.",
  "frontend/src/components/states/LoadingState.tsx": "Skeleton-based loading placeholder showing heading and card loaders.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login/logout handling, and identity persistence via AuthClient.",
  "frontend/src/hooks/useRequirePrototypeSignIn.ts": "Utility hook enforcing prototype sign‑in, redirecting and showing a toast when required.",
  "frontend/src/index.css": "Tailwind setup defining light/dark theme CSS variables and base global styles.",
  "frontend/src/lib/utils.ts": "Provides a utility function that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "App entry point mounting React, setting up React Query and Internet Identity provider.",
  "frontend/src/pages/AlertsRulesPage.tsx": "Displays predefined alert rules with toggle controls, syncing state via alertsQueries.",
  "frontend/src/pages/LandingPage.tsx": "Marketing-style landing page with navigation buttons and feature highlights.",
  "frontend/src/pages/LibraryHistoryPage.tsx": "Shows library access states depending on sign‑in and Pro status, with locked/prototype UI.",
  "frontend/src/pages/PortfolioPage.tsx": "Portfolio health view using demo or user data, with asset editor controls and snapshot analysis.",
  "frontend/src/pages/ProfilePage.tsx": "Profile settings page handling sign‑in, timezone, and topic preferences with update actions.",
  "frontend/src/pages/ResearchModePage.tsx": "UI page for selecting topics, generating placeholder research items via mutations, and displaying or saving research results.",
  "frontend/src/pages/RootPage.tsx": "Redirects signed‑in users to the brief page and otherwise renders the landing page.",
  "frontend/src/pages/TodaysBriefPage.tsx": "Displays today’s brief with demo fallback, handles generation of new briefs, and shows loading or empty states.",
  "frontend/src/queries/alertsQueries.ts": "Provides alert rule fetching, creation, toggling, and auto‑ensuring predefined rules using react‑query.",
  "frontend/src/queries/briefQueries.ts": "Fetches and sorts daily briefs and provides a mutation for creating new briefs.",
  "frontend/src/queries/libraryQueries.ts": "Loads briefs, research items, and portfolio snapshots for the library section using react‑query.",
  "frontend/src/queries/portfolioQueries.ts": "Retrieves portfolio snapshots and exposes mutations to add assets and create snapshots.",
  "frontend/src/queries/profileQueries.ts": "Fetches and updates user profiles keyed by email via react‑query.",
  "frontend/src/queries/researchQueries.ts": "Provides research item retrieval plus mutations for creating and saving research entries.",
  "frontend/src/state/usePrototypeSession.ts": "Zustand store persisting a prototype session email with setters to update or clear it.",
  "frontend/tailwind.config.js": "Tailwind config enabling themes, custom colors, typography, animations, and container queries.",
  "project_state.json": "Describes the PulseBrief prototype’s state, including versioning, feature summaries, design principles, known issues, and compliance requirements. Documents existing UX/UI architecture, dark fintech theme goals, and constraints for copy-only updates without redeployment."
}