{
  "backend/main.mo": "Defines Motoko actor with types and CRUD-style functions for daily briefs, research items, portfolio snapshots, alert rules, profiles, and assets.",
  "feature_evidence.json": "Feature evidence record describing footer preview note addition and associated files, components, tests, and metadata.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to short textual summaries for reference or documentation.",
  "frontend/DRAFT_PREVIEW.md": "Guide explaining how to run a local preview build of the PulseBrief frontend without deployment.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables and base styles for light and dark modes.",
  "frontend/index.html": "Base HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theme provider, public and protected layouts, and app shell integration.",
  "frontend/src/components/auth/PrototypeSignInDialog.tsx": "Modal dialog for prototype email sign-in with validation and success/error toasts.",
  "frontend/src/components/brand/ClickableWordmark.tsx": "Clickable PulseBrief wordmark button that navigates to the home page.",
  "frontend/src/components/brand/Wordmark.tsx": "Image-based PulseBrief wordmark component with configurable size.",
  "frontend/src/components/brief/YesterdayVsTodayWidget.tsx": "Card widget comparing today's and yesterday's brief metrics with directional indicators.",
  "frontend/src/components/charts/ChartPlaceholder.tsx": "Placeholder card showing a mock chart area with title and description.",
  "frontend/src/components/common/DemoStateIndicator.tsx": "UI badge indicating demo or sample preview mode.",
  "frontend/src/components/common/ScorePill.tsx": "Visual pill component displaying a score relative to a max with color-coded styling.",
  "frontend/src/components/common/StandardScore.tsx": "Displays a labeled score with a tooltip and sanitized one-sentence explanation.",
  "frontend/src/components/compliance/DisclaimerBar.tsx": "Renders a footer with an informational disclaimer and attribution.",
  "frontend/src/components/layout/AppNav.tsx": "Top navigation bar with route links, user display, and logout handling.",
  "frontend/src/components/layout/AppShell.tsx": "Wraps pages with navigation, main content area, and footer disclaimer.",
  "frontend/src/components/layout/ProtectedPrototypeGate.tsx": "Redirects unauthenticated users to profile or shows sign-in dialog, otherwise renders children.",
  "frontend/src/components/portfolio/AssetEditor.tsx": "Form component for adding portfolio assets with validation and sign‑in enforcement.",
  "frontend/src/components/states/EmptyState.tsx": "Displays an empty-state message with icon, description, and optional action.",
  "frontend/src/components/states/LoadingState.tsx": "Shows skeleton placeholders for loading content sections.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to identity changes and invalidates dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, login/logout handling, and identity initialization.",
  "frontend/src/hooks/useRequirePrototypeSignIn.ts": "Utility hook that enforces prototype sign‑in and redirects with a toast message.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables for light/dark themes.",
  "frontend/src/lib/utils.ts": "Utility function merging Tailwind class names with clsx and twMerge.",
  "frontend/src/main.tsx": "App entrypoint setting up ReactQuery, identity provider, and global styles.",
  "frontend/src/pages/AlertsRulesPage.tsx": "Renders predefined alert rules with toggle controls and syncs them using alerts queries. Ensures rules exist, handles toggling, and displays descriptions and statuses.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with marketing content, navigation buttons, and feature highlights. Directs users to view the daily brief or add a portfolio.",
  "frontend/src/pages/LibraryHistoryPage.tsx": "Shows library access states based on sign‑in and Pro status, offering sign‑in or upgrade prompts. Actual library content is gated behind a Pro requirement.",
  "frontend/src/pages/PortfolioPage.tsx": "Displays portfolio health analysis with demo data or user snapshots, allowing asset editing and triggering analysis. Handles sign‑in gating, loading state, and snapshot creation.",
  "frontend/src/pages/ProfilePage.tsx": "Manages user sign‑in and profile settings including email, timezone, and topics. Updates profile via mutations and redirects after saving.",
  "frontend/src/pages/ResearchModePage.tsx": "Provides topic‑based research generation and saving using research queries. Lets users select preset topics, create placeholder research, and view saved results.",
  "frontend/src/pages/RootPage.tsx": "Redirects signed‑in users to the brief page; otherwise shows the landing page.",
  "frontend/src/pages/TodaysBriefPage.tsx": "Renders the Today’s Brief page, loading the latest brief or demo data and allowing users to generate a new brief via mutation.",
  "frontend/src/queries/alertsQueries.ts": "Provides React Query hooks for listing, creating, toggling, and ensuring predefined alert rules via the actor API.",
  "frontend/src/queries/briefQueries.ts": "Defines hooks to fetch and sort daily briefs and to create new briefs through actor mutations.",
  "frontend/src/queries/libraryQueries.ts": "Fetches briefs, research items, and portfolio snapshots for the library view using actor-backed queries.",
  "frontend/src/queries/portfolioQueries.ts": "Exposes hooks for loading portfolio snapshots and mutating assets and snapshots through the actor API.",
  "frontend/src/queries/profileQueries.ts": "Loads and updates a user profile based on email using actor queries and mutations.",
  "frontend/src/queries/researchQueries.ts": "Manages research item retrieval and creation/saving mutations through React Query.",
  "frontend/src/state/usePrototypeSession.ts": "Zustand store persisting prototype user email with setters to update or clear it.",
  "frontend/tailwind.config.js": "Tailwind CSS config extending colors, typography, animations, and themes for the app’s design system.",
  "project_state.json": "Captures the project’s metadata, design notes, known issues, and existing features for the PulseBrief prototype."
}