{
  "kind": "build_request",
  "title": "Mark PulseBrief as Public Preview with footer note",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-50",
      "text": "Add a Public Preview note to the global footer so it appears across the app (including Landing and authenticated app shell), using exactly this English copy: \"PulseBrief is in public preview. Some features are limited. Pro (£19/month) coming soon.\" Place the note in the footer without changing the existing compliance disclaimer text: \"Informational only. Not financial advice.\"",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "Yes, mark it as Public Preview.\n\nUse this note:\n\"PulseBrief is in public preview. Some features are limited. Pro (£19/month) coming soon.\"\n\nPlace the note in the footer."
        ]
      },
      "acceptanceCriteria": [
        "The footer renders the note exactly as: \"PulseBrief is in public preview. Some features are limited. Pro (£19/month) coming soon.\"",
        "The note is visible in the footer on all routes/pages where the existing footer is shown (e.g., Landing and AppShell pages).",
        "The existing compliance disclaimer text remains unchanged and continues to read exactly: \"Informational only. Not financial advice.\"",
        "No other user-facing copy, features, access logic, or page layouts are modified beyond adding this footer note."
      ]
    }
  ],
  "constraints": [
    "Frontend-only change (copy/presentation only); no backend changes.",
    "Do not alter any existing features, gating logic, or routing behavior.",
    "Do not change the existing compliance disclaimer copy: “Informational only. Not financial advice.”",
    "Use English for all user-facing text.",
    "Do not rebuild, redeploy, or create a new draft preview; rely on the existing deployed preview (only update labeling/copy in the specification scope)."
  ],
  "nonGoals": [
    "Implementing new Research access logic or changing Research page content.",
    "Adding payment/checkout or changing Pro entitlement behavior.",
    "Adding new pages or navigation items.",
    "Changing header content; the Public Preview labeling request should be satisfied via the footer note only."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}